{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOXsG55riD8ntZ6XhOGRhJY"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"},"widgets":{"application/vnd.jupyter.widget-state+json":{"22fbd55aaf9e4df88842c2b5bbdfc173":{"model_module":"yfiles-jupyter-graphs","model_name":"GraphModel","model_module_version":"^1.10.1","state":{"_context_pane_mapping":[{"id":"Neighborhood","title":"Neighborhood"},{"id":"Data","title":"Data"},{"id":"Search","title":"Search"},{"id":"About","title":"About"}],"_data_importer":"neo4j","_directed":true,"_dom_classes":[],"_edges":[{"id":1152928101676613600,"start":0,"end":1,"properties":{"label":"MADE"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"MADE"}],"_graph_layout":{"algorithm":"organic","options":{}},"_highlight":[],"_license":{},"_model_module":"yfiles-jupyter-graphs","_model_module_version":"^1.10.1","_model_name":"GraphModel","_neighborhood":{},"_nodes":[{"id":0,"properties":{"balance":1200,"name":"Walt Whitman","id":"ACC123456","type":"Checking","label":"Account"},"color":"#2196F3","styles":{},"label":"Walt Whitman","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":1,"properties":{"datetime":"2024-08-25 14:32","amount":150.75,"merchant":"ABC Store","location":"New York, NY","id":"1234567890","type":"Purchase","label":"Transaction"},"color":"#4CAF50","styles":{},"label":"Transaction","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]}],"_overview":{"enabled":null,"overview_set":false},"_selected_graph":[[],[]],"_sidebar":{"enabled":false,"start_with":null},"_view_count":null,"_view_module":"yfiles-jupyter-graphs","_view_module_version":"^1.10.1","_view_name":"GraphView","layout":"IPY_MODEL_136c158a21b94433906eb74146f1ae34","tabbable":null,"tooltip":null}},"136c158a21b94433906eb74146f1ae34":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"2.0.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"2.0.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"2.0.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border_bottom":null,"border_left":null,"border_right":null,"border_top":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":"500px","justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"100%"}},"6a0498a271ea462dac69db6fab28af44":{"model_module":"yfiles-jupyter-graphs","model_name":"GraphModel","model_module_version":"^1.10.1","state":{"_context_pane_mapping":[{"id":"Neighborhood","title":"Neighborhood"},{"id":"Data","title":"Data"},{"id":"Search","title":"Search"},{"id":"About","title":"About"}],"_data_importer":"neo4j","_directed":true,"_dom_classes":[],"_edges":[],"_graph_layout":{"algorithm":"organic","options":{}},"_highlight":[],"_license":{},"_model_module":"yfiles-jupyter-graphs","_model_module_version":"^1.10.1","_model_name":"GraphModel","_neighborhood":{},"_nodes":[{"id":1,"properties":{"datetime":"2024-08-25 14:32","amount":150.75,"merchant":"ABC Store","location":"New York, NY","id":"1234567890","type":"Purchase","label":"Transaction"},"color":"#2196F3","styles":{},"label":"Transaction","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]}],"_overview":{"enabled":null,"overview_set":false},"_selected_graph":[[{"id":1,"properties":{"datetime":"2024-08-25 14:32","amount":150.75,"merchant":"ABC Store","location":"New York, NY","id":"1234567890","type":"Purchase","label":"Transaction"}}],[]],"_sidebar":{"enabled":false,"start_with":null},"_view_count":null,"_view_module":"yfiles-jupyter-graphs","_view_module_version":"^1.10.1","_view_name":"GraphView","layout":"IPY_MODEL_527d95c5e389488b9c93970dbfd20079","tabbable":null,"tooltip":null}},"527d95c5e389488b9c93970dbfd20079":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"2.0.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"2.0.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"2.0.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border_bottom":null,"border_left":null,"border_right":null,"border_top":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":"500px","justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"100%"}},"4c026f824f4f4e2090a298507f41a76f":{"model_module":"yfiles-jupyter-graphs","model_name":"GraphModel","model_module_version":"^1.10.1","state":{"_context_pane_mapping":[{"id":"Neighborhood","title":"Neighborhood"},{"id":"Data","title":"Data"},{"id":"Search","title":"Search"},{"id":"About","title":"About"}],"_data_importer":"neo4j","_directed":true,"_dom_classes":[],"_edges":[{"id":1152928101676613600,"start":0,"end":1,"properties":{"label":"MADE"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"MADE"}],"_graph_layout":{"algorithm":"organic","options":{}},"_highlight":[],"_license":{},"_model_module":"yfiles-jupyter-graphs","_model_module_version":"^1.10.1","_model_name":"GraphModel","_neighborhood":{},"_nodes":[{"id":0,"properties":{"balance":1200,"name":"Walt Whitman","id":"ACC123456","type":"Checking","label":"Account"},"color":"#2196F3","styles":{},"label":"Walt Whitman","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":1,"properties":{"datetime":"2024-08-25 14:32","amount":150.75,"merchant":"ABC Store","location":"New York, NY","id":"1234567890","type":"Purchase","label":"Transaction"},"color":"#4CAF50","styles":{},"label":"Transaction","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]}],"_overview":{"enabled":null,"overview_set":false},"_selected_graph":[[{"id":1,"properties":{"datetime":"2024-08-25 14:32","amount":150.75,"merchant":"ABC Store","location":"New York, NY","id":"1234567890","type":"Purchase","label":"Transaction"}}],[]],"_sidebar":{"enabled":false,"start_with":null},"_view_count":null,"_view_module":"yfiles-jupyter-graphs","_view_module_version":"^1.10.1","_view_name":"GraphView","layout":"IPY_MODEL_896f948065eb4b2c8e569301aaa1613c","tabbable":null,"tooltip":null}},"896f948065eb4b2c8e569301aaa1613c":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"2.0.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"2.0.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"2.0.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border_bottom":null,"border_left":null,"border_right":null,"border_top":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":"500px","justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"100%"}}}}},"cells":[{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"qKh8_uk8hkgb","executionInfo":{"status":"ok","timestamp":1738885210005,"user_tz":300,"elapsed":2574,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"b84913a3-66b7-4930-cb51-54918bfa0ba2"},"outputs":[{"output_type":"stream","name":"stdout","text":["Requirement already satisfied: neo4j in /usr/local/lib/python3.11/dist-packages (5.28.0)\n","Requirement already satisfied: yfiles_jupyter_graphs_for_neo4j in /usr/local/lib/python3.11/dist-packages (1.6.0)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.11/dist-packages (from neo4j) (2025.1)\n","Requirement already satisfied: yfiles_jupyter_graphs>=1.9.0 in /usr/local/lib/python3.11/dist-packages (from yfiles_jupyter_graphs_for_neo4j) (1.10.1)\n","Requirement already satisfied: ipywidgets>=8.0.0 in /usr/local/lib/python3.11/dist-packages (from yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (8.1.5)\n","Requirement already satisfied: comm>=0.1.3 in /usr/local/lib/python3.11/dist-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.2.2)\n","Requirement already satisfied: ipython>=6.1.0 in /usr/local/lib/python3.11/dist-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (7.34.0)\n","Requirement already satisfied: traitlets>=4.3.1 in /usr/local/lib/python3.11/dist-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (5.7.1)\n","Requirement already satisfied: widgetsnbextension~=4.0.12 in /usr/local/lib/python3.11/dist-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (4.0.13)\n","Requirement already satisfied: jupyterlab-widgets~=3.0.12 in /usr/local/lib/python3.11/dist-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (3.0.13)\n","Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (75.1.0)\n","Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.19.2)\n","Requirement already satisfied: decorator in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (4.4.2)\n","Requirement already satisfied: pickleshare in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.7.5)\n","Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (3.0.50)\n","Requirement already satisfied: pygments in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (2.18.0)\n","Requirement already satisfied: backcall in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.2.0)\n","Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.1.7)\n","Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.11/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (4.9.0)\n","Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.11/dist-packages (from jedi>=0.16->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.8.4)\n","Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.11/dist-packages (from pexpect>4.3->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.7.0)\n","Requirement already satisfied: wcwidth in /usr/local/lib/python3.11/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles_jupyter_graphs>=1.9.0->yfiles_jupyter_graphs_for_neo4j) (0.2.13)\n"]}],"source":["!pip install neo4j yfiles_jupyter_graphs_for_neo4j"]},{"cell_type":"code","source":["from neo4j import GraphDatabase\n","from google.colab import userdata\n","\n","neo4j_password = userdata.get('neo4j_password')\n","\n","driver = GraphDatabase.driver(\"neo4j+s://7ffc03b9.databases.neo4j.io:7687\", auth=(\"neo4j\", neo4j_password))"],"metadata":{"id":"bXwDrivhhste","executionInfo":{"status":"ok","timestamp":1738885214325,"user_tz":300,"elapsed":2416,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":3,"outputs":[]},{"cell_type":"code","source":["def creating_vertices(tx):\n","    query = \"\"\"\n","      CREATE (a:Account {id: 'ACC123456', name: 'Walt Whitman', type: 'Checking', balance: 1200.00})\n","      CREATE (t:Transaction {id: '1234567890', amount: 150.75, type: 'Purchase', merchant: 'ABC Store', location: 'New York, NY', datetime: '2024-08-25 14:32'})\n","\n","    RETURN *\n","    \"\"\"\n","    tx.run(query)\n","\n","# Run the query\n","with driver.session() as session:\n","    session.execute_write(creating_vertices)"],"metadata":{"id":"0x7S3YbeiFH-","executionInfo":{"status":"ok","timestamp":1738885217261,"user_tz":300,"elapsed":824,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":4,"outputs":[]},{"cell_type":"code","source":["def creating_edges(tx):\n","    query = \"\"\"\n","      MATCH (a:Account {id: 'ACC123456'}), (t:Transaction {id: '1234567890'})\n","        CREATE (a)-[:MADE]->(t)\n","\n","    RETURN *\n","    \"\"\"\n","    tx.run(query)\n","\n","with driver.session() as session:\n","    session.execute_write(creating_edges)"],"metadata":{"id":"lTvNEEZDi9Qn","executionInfo":{"status":"ok","timestamp":1738885218812,"user_tz":300,"elapsed":257,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":5,"outputs":[]},{"cell_type":"code","source":["from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n","\n","g = Neo4jGraphWidget(driver)\n","\n","def show_graph(driver):\n","    query = \"\"\"\n","    MATCH (n)-[r]->(m)\n","    RETURN n, r, m\n","    \"\"\"\n","    g.show_cypher(query)\n","\n","show_graph(driver)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":517,"referenced_widgets":["22fbd55aaf9e4df88842c2b5bbdfc173","136c158a21b94433906eb74146f1ae34"]},"id":"GWb0aPfmjEjV","executionInfo":{"status":"ok","timestamp":1738885235333,"user_tz":300,"elapsed":165,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"7f2d1153-c0e7-40bb-83a6-e309b35d1642"},"execution_count":8,"outputs":[{"output_type":"display_data","data":{"text/plain":["GraphWidget(layout=Layout(height='500px', width='100%'))"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"22fbd55aaf9e4df88842c2b5bbdfc173"}},"metadata":{"application/vnd.jupyter.widget-view+json":{"colab":{"custom_widget_manager":{"url":"https://ssl.gstatic.com/colaboratory-static/widgets/colab-cdn-widget-manager/2b70e893a8ba7c0f/manager.min.js"}}}}}]},{"cell_type":"code","source":["def querying_data(driver):\n","    query = \"\"\"\n","    MATCH (a:Account {id: 'ACC123456'})-[:MADE]->(t:Transaction)\n","    RETURN t\n","    \"\"\"\n","    g.show_cypher(query)\n","\n","querying_data(driver)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":517,"referenced_widgets":["6a0498a271ea462dac69db6fab28af44","527d95c5e389488b9c93970dbfd20079"]},"id":"FAysuh5BkvDc","executionInfo":{"status":"ok","timestamp":1738885239950,"user_tz":300,"elapsed":260,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"88a13e4a-125e-4a82-be12-f81d3e8d9e61"},"execution_count":9,"outputs":[{"output_type":"display_data","data":{"text/plain":["GraphWidget(layout=Layout(height='500px', width='100%'))"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"6a0498a271ea462dac69db6fab28af44"}},"metadata":{"application/vnd.jupyter.widget-view+json":{"colab":{"custom_widget_manager":{"url":"https://ssl.gstatic.com/colaboratory-static/widgets/colab-cdn-widget-manager/2b70e893a8ba7c0f/manager.min.js"}}}}}]},{"cell_type":"code","source":["def filtering_data(driver):\n","    query = \"\"\"\n","    MATCH (a:Account)-[r:MADE]->(t:Transaction)\n","    WHERE t.amount > 100\n","    RETURN a, r, t\n","    \"\"\"\n","    g.show_cypher(query)\n","\n","filtering_data(driver)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":517,"referenced_widgets":["4c026f824f4f4e2090a298507f41a76f","896f948065eb4b2c8e569301aaa1613c"]},"id":"SCPKSUy5lWi3","executionInfo":{"status":"ok","timestamp":1738885246769,"user_tz":300,"elapsed":416,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"82f81f5e-1e47-4f60-b8d2-43a5d8c0e891"},"execution_count":10,"outputs":[{"output_type":"display_data","data":{"text/plain":["GraphWidget(layout=Layout(height='500px', width='100%'))"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"4c026f824f4f4e2090a298507f41a76f"}},"metadata":{"application/vnd.jupyter.widget-view+json":{"colab":{"custom_widget_manager":{"url":"https://ssl.gstatic.com/colaboratory-static/widgets/colab-cdn-widget-manager/2b70e893a8ba7c0f/manager.min.js"}}}}}]},{"cell_type":"code","source":["def aggregating_data(tx):\n","    query = \"\"\"\n","      MATCH (a:Account {id: 'ACC123456'})-[:MADE]->(t:Transaction)\n","      RETURN a.id AS account_id, SUM(t.amount) AS total_spent\n","    \"\"\"\n","    result = tx.run(query)\n","    return [record.data() for record in result]\n","\n","with driver.session() as session:\n","    results = session.execute_read(aggregating_data)\n","    print(results)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ORqzK5CrmB_d","executionInfo":{"status":"ok","timestamp":1738885250093,"user_tz":300,"elapsed":253,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"32bbe8e0-1b01-4e4d-dd77-d409ecfde707"},"execution_count":11,"outputs":[{"output_type":"stream","name":"stdout","text":["[{'account_id': 'ACC123456', 'total_spent': 150.75}]\n"]}]},{"cell_type":"code","source":["def upserting_vertices(tx):\n","    query = \"\"\"\n","      MERGE (a:Account {id: 'ACC123456'})\n","      ON MATCH SET a.balance = 1300.00\n","      ON CREATE SET a.name = 'Walt Whitman', a.balance = 1200.00, a.type = 'Checking'\n","\n","    RETURN *\n","    \"\"\"\n","    tx.run(query)\n","\n","with driver.session() as session:\n","    session.execute_write(upserting_vertices)"],"metadata":{"id":"rq0ykujxDaBB","executionInfo":{"status":"ok","timestamp":1738885251867,"user_tz":300,"elapsed":295,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":12,"outputs":[]},{"cell_type":"code","source":["def distinct_data(tx):\n","    query = \"\"\"\n","      MATCH (a:Account)-[:MADE]->(t:Transaction)\n","      RETURN DISTINCT t.merchant\n","    \"\"\"\n","    result = tx.run(query)\n","    return [record.data() for record in result]\n","\n","with driver.session() as session:\n","    results = session.execute_read(distinct_data)\n","    print(results)"],"metadata":{"id":"ZbLyJKpHIAKx","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1738885253661,"user_tz":300,"elapsed":224,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"95a273b6-b478-4da6-a31c-054cad24317c"},"execution_count":13,"outputs":[{"output_type":"stream","name":"stdout","text":["[{'t.merchant': 'ABC Store'}]\n"]}]},{"cell_type":"code","source":["def label_data_with_case(tx):\n","    query = \"\"\"\n","      MATCH (a:Account)-[:MADE]->(t:Transaction)\n","      RETURN a.id,\n","        CASE\n","          WHEN t.amount > 1000 THEN 'High-value transaction'\n","          ELSE 'Regular transaction'\n","        END AS transaction_type\n","    \"\"\"\n","    result = tx.run(query)\n","    return [record.data() for record in result]\n","\n","with driver.session() as session:\n","    results = session.execute_read(label_data_with_case)\n","    print(results)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"UpL1BspRGacu","executionInfo":{"status":"ok","timestamp":1738885255562,"user_tz":300,"elapsed":193,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"abed4fd0-71e2-4941-a926-a83e8c7a779a"},"execution_count":14,"outputs":[{"output_type":"stream","name":"stdout","text":["[{'a.id': 'ACC123456', 'transaction_type': 'Regular transaction'}]\n"]}]},{"cell_type":"code","source":["def ordering_data(tx):\n","    query = \"\"\"\n","      MATCH (a:Account)-[:MADE]->(t:Transaction)\n","      RETURN a.id, t.amount\n","      ORDER BY t.amount DESC\n","    \"\"\"\n","    result = tx.run(query)\n","    return [record.data() for record in result]\n","\n","with driver.session() as session:\n","    results = session.execute_read(ordering_data)\n","    print(results)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"gKwLOFyeIy1Y","executionInfo":{"status":"ok","timestamp":1738885257659,"user_tz":300,"elapsed":478,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"8a169c0a-b05f-42c9-f12a-62d921adf7a9"},"execution_count":15,"outputs":[{"output_type":"stream","name":"stdout","text":["[{'a.id': 'ACC123456', 't.amount': 150.75}]\n"]}]},{"cell_type":"code","source":["def deleting_vertices_and_edges(tx):\n","    query = \"\"\"\n","    MATCH (a:Account {id: 'ACC123456'})-[r:MADE]->(t:Transaction)\n","    DELETE r, t, a\n","    \"\"\"\n","    tx.run(query)\n","\n","with driver.session() as session:\n","    session.execute_write(deleting_vertices_and_edges)"],"metadata":{"id":"4Aw_-LVlJK3S","executionInfo":{"status":"ok","timestamp":1738885261303,"user_tz":300,"elapsed":320,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":16,"outputs":[]},{"cell_type":"code","source":["from google.colab import output\n","output.enable_custom_widget_manager()"],"metadata":{"id":"W3SoAm9ZjR9Y","executionInfo":{"status":"ok","timestamp":1738885225418,"user_tz":300,"elapsed":7,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}}},"execution_count":7,"outputs":[]},{"cell_type":"markdown","source":["Support for third party widgets will remain active for the duration of the session. To disable support:"],"metadata":{"id":"nlHD9N09jR9Z"}},{"cell_type":"code","source":["from google.colab import output\n","output.disable_custom_widget_manager()"],"metadata":{"id":"ORKOLUSWjR9b"},"execution_count":null,"outputs":[]}]}