{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[{"file_id":"1dnrfe8_158x-CIBxdK9QVYWRzuezf5oL","timestamp":1726596593520},{"file_id":"1ZfN7_ie3rc9m3nRafzyv027tqrRtziv1","timestamp":1726592680824}],"authorship_tag":"ABX9TyPq8TnYy4SBsePqjMiBDqc0"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"},"widgets":{"application/vnd.jupyter.widget-state+json":{"f9fd7e26bb664214849929d2753d32a7":{"model_module":"yfiles-jupyter-graphs","model_name":"GraphModel","model_module_version":"^1.10.1","state":{"_context_pane_mapping":[{"id":"Neighborhood","title":"Neighborhood"},{"id":"Data","title":"Data"},{"id":"Search","title":"Search"},{"id":"About","title":"About"}],"_data_importer":"neo4j","_directed":true,"_dom_classes":[],"_edges":[{"id":1152931400211497000,"start":28,"end":32,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1155183200025182200,"start":28,"end":33,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1157434999838867500,"start":28,"end":36,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1152931400211497000,"start":29,"end":33,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1155183200025182200,"start":29,"end":34,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1157434999838867500,"start":29,"end":37,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1152931400211497000,"start":30,"end":32,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1155183200025182200,"start":30,"end":35,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1152931400211497000,"start":31,"end":34,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1159686799652552700,"start":31,"end":35,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1155183200025182200,"start":31,"end":36,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"},{"id":1157434999838867500,"start":31,"end":37,"properties":{"label":"LIKES"},"color":"#F44336","thickness_factor":1,"directed":true,"styles":{},"label":"LIKES"}],"_graph_layout":{"algorithm":"organic","options":{}},"_highlight":[],"_license":{},"_model_module":"yfiles-jupyter-graphs","_model_module_version":"^1.10.1","_model_name":"GraphModel","_neighborhood":{},"_nodes":[{"id":28,"properties":{"name":"Alice","label":"Person"},"color":"#2196F3","styles":{},"label":"Alice","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":32,"properties":{"name":"Reading","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Reading","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":33,"properties":{"name":"Cooking","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Cooking","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":36,"properties":{"name":"Chess","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Chess","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":29,"properties":{"name":"Bob","label":"Person"},"color":"#2196F3","styles":{},"label":"Bob","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":34,"properties":{"name":"Cycling","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Cycling","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":37,"properties":{"name":"Music","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Music","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":30,"properties":{"name":"Carol","label":"Person"},"color":"#2196F3","styles":{},"label":"Carol","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":35,"properties":{"name":"Hiking","label":"Interest"},"color":"#4CAF50","styles":{},"label":"Hiking","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":31,"properties":{"name":"Dave","label":"Person"},"color":"#2196F3","styles":{},"label":"Dave","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]}],"_overview":{"enabled":null,"overview_set":false},"_selected_graph":[[],[]],"_sidebar":{"enabled":false,"start_with":null},"_view_count":null,"_view_module":"yfiles-jupyter-graphs","_view_module_version":"^1.10.1","_view_name":"GraphView","layout":"IPY_MODEL_0aab8908a1764abbb09d7c7c83f2aa67","tabbable":null,"tooltip":null}},"0aab8908a1764abbb09d7c7c83f2aa67":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"2.0.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"2.0.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"2.0.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border_bottom":null,"border_left":null,"border_right":null,"border_top":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":"500px","justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"100%"}}}}},"cells":[{"cell_type":"code","execution_count":null,"metadata":{"id":"JOlp5qcRPTJl"},"outputs":[],"source":["!pip install neo4j yfiles_jupyter_graphs_for_neo4j pandas"]},{"cell_type":"code","source":["from neo4j import GraphDatabase"],"metadata":{"id":"GYFqJsMZPWe0"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["from google.colab import userdata\n","neo4j_password = userdata.get('neo4j_password')\n","\n","driver = GraphDatabase.driver(\"neo4j+s://7ffc03b9.databases.neo4j.io:7687\", auth=(\"neo4j\", neo4j_password))"],"metadata":{"id":"O0pOvkGHPZc7"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["def insert_data(tx):\n","    query = \"\"\"\n","    // Create Person nodes\n","      CREATE (alice:Person {name: 'Alice'})\n","      CREATE (bob:Person   {name: 'Bob'})\n","      CREATE (carol:Person {name: 'Carol'})\n","      CREATE (dave:Person  {name: 'Dave'})\n","\n","      // Create Interest nodes\n","      CREATE (reading:Interest  {name: 'Reading'})\n","      CREATE (cooking:Interest  {name: 'Cooking'})\n","      CREATE (cycling:Interest  {name: 'Cycling'})\n","      CREATE (hiking:Interest   {name: 'Hiking'})\n","      CREATE (chess:Interest    {name: 'Chess'})\n","      CREATE (music:Interest    {name: 'Music'})\n","\n","      // Create :LIKES relationships\n","\n","      // Alice likes Reading, Cooking, Chess\n","      CREATE (alice)-[:LIKES]->(reading)\n","      CREATE (alice)-[:LIKES]->(cooking)\n","      CREATE (alice)-[:LIKES]->(chess)\n","\n","      // Bob likes Cooking, Cycling, Music\n","      CREATE (bob)-[:LIKES]->(cooking)\n","      CREATE (bob)-[:LIKES]->(cycling)\n","      CREATE (bob)-[:LIKES]->(music)\n","\n","      // Carol likes Reading, Hiking\n","      CREATE (carol)-[:LIKES]->(reading)\n","      CREATE (carol)-[:LIKES]->(hiking)\n","\n","      // Dave likes Cycling, Chess, Music, Hiking\n","      CREATE (dave)-[:LIKES]->(cycling)\n","      CREATE (dave)-[:LIKES]->(chess)\n","      CREATE (dave)-[:LIKES]->(music)\n","      CREATE (dave)-[:LIKES]->(hiking)\n","      RETURN *\n","    \"\"\"\n","    tx.run(query)\n","\n","with driver.session() as session:\n","    session.execute_write(insert_data)"],"metadata":{"id":"8jtAghWCPq8Q"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n","\n","g = Neo4jGraphWidget(driver)\n","\n","def show_graph(driver):\n","    query = \"\"\"\n","    MATCH (n)-[r]->(m)\n","    RETURN n, r, m\n","    \"\"\"\n","    g.show_cypher(query)\n","\n","show_graph(driver)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":517,"referenced_widgets":["f9fd7e26bb664214849929d2753d32a7","0aab8908a1764abbb09d7c7c83f2aa67"]},"id":"t8J5nj7a9Ya2","executionInfo":{"status":"ok","timestamp":1738615713868,"user_tz":300,"elapsed":258,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"6eb3ee62-b0e3-4142-9ad6-6d9359e35e6b"},"execution_count":null,"outputs":[{"output_type":"display_data","data":{"text/plain":["GraphWidget(layout=Layout(height='500px', width='100%'))"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"f9fd7e26bb664214849929d2753d32a7"}},"metadata":{"application/vnd.jupyter.widget-view+json":{"colab":{"custom_widget_manager":{"url":"https://ssl.gstatic.com/colaboratory-static/widgets/colab-cdn-widget-manager/2b70e893a8ba7c0f/manager.min.js"}}}}}]},{"cell_type":"code","source":["from google.colab import output\n","output.enable_custom_widget_manager()"],"metadata":{"id":"0ic-PU6p9hKT"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Support for third party widgets will remain active for the duration of the session. To disable support:"],"metadata":{"id":"GNm57WYd9hKT"}},{"cell_type":"code","source":["from google.colab import output\n","output.disable_custom_widget_manager()"],"metadata":{"id":"6dTxaTAA9hKT"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["import pandas as pd\n","\n","def show_jaccard_similarity(driver):\n","    query = \"\"\"\n","      MATCH (p1:Person)-[:LIKES]->(i1:Interest),\n","        (p2:Person)-[:LIKES]->(i2:Interest)\n","      WHERE p1 <> p2\n","      WITH p1, p2,\n","          collect(DISTINCT i1.name) AS interests1,\n","          collect(DISTINCT i2.name) AS interests2\n","      WITH p1, p2,\n","          apoc.coll.intersection(interests1, interests2) AS intersection,\n","          apoc.coll.union(interests1, interests2) AS union\n","      RETURN p1.name AS PersonA,\n","            p2.name AS PersonB,\n","            CASE WHEN size(union) = 0 THEN 0\n","                  ELSE size(intersection)*1.0/size(union)\n","            END AS jaccard_similarity\n","      ORDER BY jaccard_similarity DESC;\n","    \"\"\"\n","    with driver.session() as session:\n","        result = session.run(query)\n","        return [record.data() for record in result]\n","\n","results = show_jaccard_similarity(driver)\n","pd.DataFrame(results)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":426},"id":"bUtQ7csFVZNZ","executionInfo":{"status":"ok","timestamp":1738615744937,"user_tz":300,"elapsed":451,"user":{"displayName":"Zubair Nabi","userId":"14783280215479013636"}},"outputId":"328ac960-9260-47e6-dcbe-12a841b70991"},"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["   PersonA PersonB  jaccard_similarity\n","0      Bob    Dave            0.400000\n","1     Dave     Bob            0.400000\n","2    Alice   Carol            0.250000\n","3    Carol   Alice            0.250000\n","4    Alice     Bob            0.200000\n","5      Bob   Alice            0.200000\n","6    Carol    Dave            0.200000\n","7     Dave   Carol            0.200000\n","8    Alice    Dave            0.166667\n","9     Dave   Alice            0.166667\n","10     Bob   Carol            0.000000\n","11   Carol     Bob            0.000000"],"text/html":["\n","  <div id=\"df-45b5ad3e-a8e2-4acf-b736-a96156583468\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>PersonA</th>\n","      <th>PersonB</th>\n","      <th>jaccard_similarity</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Bob</td>\n","      <td>Dave</td>\n","      <td>0.400000</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Dave</td>\n","      <td>Bob</td>\n","      <td>0.400000</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Alice</td>\n","      <td>Carol</td>\n","      <td>0.250000</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Carol</td>\n","      <td>Alice</td>\n","      <td>0.250000</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Alice</td>\n","      <td>Bob</td>\n","      <td>0.200000</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Bob</td>\n","      <td>Alice</td>\n","      <td>0.200000</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Carol</td>\n","      <td>Dave</td>\n","      <td>0.200000</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Dave</td>\n","      <td>Carol</td>\n","      <td>0.200000</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Alice</td>\n","      <td>Dave</td>\n","      <td>0.166667</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Dave</td>\n","      <td>Alice</td>\n","      <td>0.166667</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Bob</td>\n","      <td>Carol</td>\n","      <td>0.000000</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Carol</td>\n","      <td>Bob</td>\n","      <td>0.000000</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-45b5ad3e-a8e2-4acf-b736-a96156583468')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-45b5ad3e-a8e2-4acf-b736-a96156583468 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-45b5ad3e-a8e2-4acf-b736-a96156583468');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","<div id=\"df-161cae95-b6f8-4f07-a4a6-3b916c4f9ef0\">\n","  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-161cae95-b6f8-4f07-a4a6-3b916c4f9ef0')\"\n","            title=\"Suggest charts\"\n","            style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","  </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","  <script>\n","    async function quickchart(key) {\n","      const quickchartButtonEl =\n","        document.querySelector('#' + key + ' button');\n","      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","      quickchartButtonEl.classList.add('colab-df-spinner');\n","      try {\n","        const charts = await google.colab.kernel.invokeFunction(\n","            'suggestCharts', [key], {});\n","      } catch (error) {\n","        console.error('Error during call to suggestCharts:', error);\n","      }\n","      quickchartButtonEl.classList.remove('colab-df-spinner');\n","      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","    }\n","    (() => {\n","      let quickchartButtonEl =\n","        document.querySelector('#df-161cae95-b6f8-4f07-a4a6-3b916c4f9ef0 button');\n","      quickchartButtonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","    })();\n","  </script>\n","</div>\n","\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","summary":"{\n  \"name\": \"pd\",\n  \"rows\": 12,\n  \"fields\": [\n    {\n      \"column\": \"PersonA\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"Dave\",\n          \"Carol\",\n          \"Bob\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"PersonB\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"Bob\",\n          \"Alice\",\n          \"Dave\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"jaccard_similarity\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 0.12326233282557446,\n        \"min\": 0.0,\n        \"max\": 0.4,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          0.25,\n          0.0,\n          0.2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{},"execution_count":25}]},{"cell_type":"code","source":["def clear_graph(tx):\n","    query = \"\"\"\n","    MATCH (n)\n","    DETACH DELETE n\n","    \"\"\"\n","    tx.run(query)\n","\n","with driver.session() as session:\n","    session.execute_write(clear_graph)"],"metadata":{"id":"VfbYf1xVkDjL"},"execution_count":null,"outputs":[]}]}